<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head><meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<title>Polish Interpreter | Polish Translator - Monika Pilatowska</title>

<meta name="description" content="Monika Pilatowska is a qualified and experienced freelance interpreter and translator and this page includes testimonials from clients." />
<meta name="author" content="Monika Pilatowska" />

<meta name="google-site-verification" content="fhwqnyMDEEM5A-fIu2LiT9dl66DhsdVDLhoqvpoqRk8" />
<link rel="stylesheet" type="text/css" href="../../styles.css" />

</head>

<body>
<div id="wrapper">
   <div id="header">
  	<div id="header-left">Monika Pi&#322;atowska<img src="../../Images/spacer.jpg" class="spacer" alt="Polish Interpreter"/></div>
	<div class="logo"><h1>Int&#233;rprete | Traductora</h1></div>
	<div id="header-right">
	<a href="../../index.html"><img src="../../Images/GB-Flag.gif" border="0" alt="English Language" /></a><br style="margin-bottom:6px"/><br />
	<a href="../Polish/polish-index.html"><img src="../../Images/PL-Flag.gif" border="0" alt="Polish Language" /></a><br style="margin-bottom:6px"/><br />
	<a href="spanish-index.html"><img src="../../Images/ES-Flag.gif" border="0" alt="Spanish Language" /></a><br /></div>
   </div>

   <div id="main">
    
	<div id="leftcolumn" class="leftmenu"><br /><br /><br /><br /><br /><br /><br /><br />
	<a href="spanish-index.html" class="leftmenu"><p class="leftmenu-links">INICIO</p></a>
	<a class="leftmenu"><p class="leftmenu-links">SOBRE M&#205;</p></a>
	<a href="spanish-Interpreting-Translation-Services.html" class="leftmenu"><p class="leftmenu-links">SERVICIOS</p></a>
	<a href="spanish-Polish-English-Spanish-Rates.html" class="leftmenu"><p class="leftmenu-links">TARIFAS</p></a>
	<a href="spanish-clients.html" class="leftmenu"><p class="leftmenu-links">CLIENTES</p></a>
	<a href="spanish-testimonials.html" class="leftmenu"><p class="leftmenu-links">RECOMENDACIONES</p></a>
	<a href="spanish-Interpreter-Translator-Contact.html" class="leftmenu"><p class="leftmenu-links">CONTACTO</p></a>
	<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />
	<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />
    </div>

<div id="rightcolumn">
	        <h1 id="h1" align="center">Recomendaciones</h1>
	  <br />

	<p class="paragraph" align="justified">"It has been a pleasure dealing with Monika who provided exactly the service I needed in a professional manner, and with a high level of efficiency and accuracy. She was very helpful and reliable in a stressful moment when I needed more documents to be translated urgently. Wonderful service from start to finish. I will not hesitate in recommending her to anyone I know who requires any form of translation."
	<p class="paragraph" align="right"><em>Beata Page</em></p>
	</p>
	<br /><br />

	<p class="paragraph" align="justified">"I highly recommend this Polish interpreter, very professional and excellent fast service! Thanks for everything. I really appreciate it."
	  <p class="paragraph" align="right"><em>Vikum</em></p>
	</p>
	<br /><br />

	<p class="paragraph" align="justified">"It was a pleasure to work with Monika. She was very professional from the initial contact I made and provided a number of options that were available to me in my specific situation. The translation (of a legal document) she completed for me was done to a very high standard and delivered to me promptly by post as well as by email. I would certainly use Monika's services again."
	  <p class="paragraph" align="right"><em>Agnieszka Karch </em></p>
	</p>
	<br /><br />
	
	<p class="paragraph" align="justified">"I recently contacted Monika Pilatowska by email in relation to translating some urgent client service documents from English into Polish.  Monika responded very promptly to my enquiry, including a full quote and service terms and went on to deliver (by email) a complete set of documents well within the proposed time frame at a reasonable cost. I would have no hesitation in working with Monika again due to her polite, professional and speedy approach."
	  <p class="paragraph" align="right"><em>Clare Kivlehan, Dogs Trust Head of Outreach Projects</em></p>
	</p>
	<br /><br />
	
	<p class="paragraph" align="justified">"First class service, with very prompt replies and attention to detail. I fully recommend using Monika. Thanks again."
	  <p class="paragraph" align="right"><em>Keith</em></p>
	</p>
	<br /><br />
		
	<p class="paragraph" align="justified">"Jestem bardzo zadowolona z t&#x142;umaczenia i z szybkiego czasu realizacji. Na pewno b&#x119;d&#x119; korzysta&#x107; z pani us&#x142;ug a tak&#x17c;e polec&#x119; swoim znajomym t&#x142;umaczenia w pani kancelarii."
	  <p class="paragraph" align="right"><em>Justyna Hassan</em></p>
	</p>
	<br /><br />
	
	<p class="paragraph" align="justified">"I can highly recommend Mrs Monika Pilatowska as a professional interpreter. She was translating documents for my wife and me and she did an outstanding job. She was very helpful and managed to translate the documents in a short period of time which, when applying for a job is a key to success."
	  <p class="paragraph" align="right"><em>Dominik Siwek</em></p>
	</p>
	<br /><br />
	
	<p class="paragraph" align="justified">"Pani Monika wykona&#x142;a przet&#x142;umaczenie moich kwalifikacji w bardzo kr&oacute;tkim terminie. Szybko i rzetelnie. Polecam."
	  <p class="paragraph" align="right"><em>Ma&#x142;gorzata</em></p>
	</p>
	<br /><br />
	
	<p class="paragraph" align="justified">"Pani Moniko. Dzi&#x119;kuj&#x119; za przet&#x142;umaczenie certyfikatu. Us&#x142;uga wykonana profesjonalnie i szybko. Dzi&#x119;kuj&#x119;. Pozdrawiam."
	  <p class="paragraph" align="right"><em>Szczepan Kamela</em></p>
	</p>
	<br /><br />
	
	<p class="paragraph" align="justified">"Kontakt do Pani Moniki znale&#x17a;li&#x15b;my przez internet. Warunki wsp&oacute;&#x142;pracy zosta&#x142;y ustalone szybko i sprawnie. Przedmiot zam&oacute;wienia czyli t&#x142;umaczenie ustne z j&#x119;zyka angielskiego na polski oraz z polskiego na angielski podczas konferencji biznesowej oceniamy jako bardzo dobre. W przysz&#x142;o&#x15b;ci planujemy korzysta&#x107; z us&#x142;ug &#x15b;wiadczonych przez Pani&#x105; Monik&#x119;."
	  <p class="paragraph" align="right"><em>Magdalena Szewczyk Specjalista ds. Relacji Inwestorskich</em></p>
	</p>
	<br /><br />				
				
	<p class="paragraph" align="justified">"I contacted Monika while she was on holiday. Regardless, she delivered translation very fast. She is very professional, helpful and would recommend her to everyone. I will not have any hesitation to choose her again."
	  <p class="paragraph" align="right"><em>Sylwia Dors</em></p>
	</p>
	<br /><br />
	
	<p class="paragraph" align="justified">"Monika assisted a colleague in attending an occupational health assessment which took place in Devon. The organisation of this meeting was straight forward and hassle free and contact was maintained throughout. The report we received as output from the assessment confirmed her excellent ability to translate English/Polish. Should the need arise, I would not hesitate to utilise her services again."
	  <p class="paragraph" align="right"><em>AB Agri Ltd</em></p>
	</p>
	<br /><br />
	
	<p class="paragraph" align="justified">"I used the services provided by Monika Pilatowska as I needed sworn translation of my birth certificate. Super fast, super professional and hassle free customer care. Will be using her services in the nearest future again to translate more official documents. I would recommend Monika if you are looking for high quality service."
	  <p class="paragraph" align="right"><em>Magda Trzcinska</em></p>
	</p>
	<br /><br />
	
	<p class="paragraph" align="justified">"Dear Monika: I am very happy to have known your name by Internet because your services as Professional Interpreter helped me a lot to clarify the name given by a 6 year old Polish boy, Kajetan Jalochowski, to whom I gave the honor to name one of Asteroids discovered in our research program from Universidad de Los Andes, Grupo de Astrof&iacute;sica Te&oacute;rica, M&eacute;rida, Rep&uacute;blica de Venezuela. Your clear explanations were sent to the International Astronomical Union (IAU) in order to clarify the meaning of this name, which already was approved by the commission dedicated to it."
	  <p class="paragraph" align="right"><em>Prof. Orlando A. Naranjo, Universidad de Los Andes</em></p>
	</p>
	<br /><br />
	
	<p class="paragraph" align="justified">"Bartolom&eacute; Rubia Avi, Profesor Titular de Universidad en la Universidad de Valladolid y Director del &Aacute;rea de Formaci&oacute;n e Innovaci&oacute;n Docente, quiero resaltar la labor realizada por D&ntilde;a. Monika Pilatowska como Interprete y traductora de diferentes documentos en Lengua Espa&ntilde;ola al Ingl&eacute;s realizados para las tareas encomendadas por mi Grupo de Investigaci&oacute;n Reconocido GSIC-EMIC (Grupo de Sistemas Inteligentes y Computacionales - Educaci&oacute;n y Medios, Inform&aacute;tica y Cultura) de la Universidad de Valladolid.
	  <br />Durante la estancia de dos personas de nuestro grupo de investigaci&oacute;n ha realizado la labor de traductora y de traductora simultanea en las actividades que durante 45 d&iacute;as estas dos personas realizaron en la London Metropolitan University.
	  <br />Me gustar&iacute;a destacar el conocimiento sobre la Lengua Inglesa y Espa&ntilde;ola para la realizaci&oacute;n de una traducci&oacute;n exacta y para la labor de puente que ha realizado la interfecta, as&iacute; como su rapidez y eficacia en su trabajo. El trabajo ha consistido en la traducci&oacute;n de 10 documentos sobre el uso de la tecnolog&iacute;a en entornos de aprendizaje colaborativo. [...]
	  <br />Y por &uacute;ltimo desear&iacute;a destacar su valor como persona y miembro de un grupo de trabajo, por el talante y la buena voluntad en su relaci&oacute;n de trabajo, as&iacute; como en lo referente a las relaciones personales y de inter&eacute;s por el propio trabajo en si. Por otra parte, creo que es una persona que tiene toda mi confianza, muy profesional y competente."
	  <p class="paragraph" align="right"><em>Bartolom&eacute; Rubia Avi, Universidad de Valladolid</em></p>
	</p>
	<br /><br />
	
	<p class="paragraph" align="justified">"Monika worked as a temporary translator for Pure Pricing during November 2006. The work involved translation of mobile operator web sites from Polish to English. In particular, she translated the overall offers and propositions from the mobile operators, the terms and conditions or "small print" of the offers and interpreted marketing terms. The information she provided was compiled into a report produced by Pure Pricing which is sold on to mobile operators across Europe. In my opinion, Monika has an excellent knowledge of English, is professional and personable; I would highly recommend Monika for translation work."
	  <p class="paragraph" align="right"><em>Jo Lynch, Director of Pure Pricing</em></p>
	</p>
	<br /><br />
	
	<p class="paragraph" align="justified">"I have known Monika Pilatowska for some time in her capacity for translating services. During this time I have found her to be diligent and precise in her approach to her work. The services supplied have been excellent and prompt to agreed deadlines. I would have no hesitation in recommending her."
	  <p class="paragraph" align="right"><em>Faron Dix</em></p>
	</p>
	<br /><br />
	
    </div>
    <div class="clear"> </div>
  </div>
  
  <div id="footer">
  <br />
  <hr />
  Polish Interpreter | Polish Conference Interpreter | Polish Business Interpreter | Polish Interpreter London | Polish Spanish Interpreter | Polish English Interpreter | Polish Translator | Polish Translation | Polish Sworn Translation
  <hr />
  <br />
  Copyright &copy; 2021 Monika Pilatowska | <a id="privacy" href="Privacy-Policy.html">Privacy Policy</a>
  </div>
  
</div>
<script type="text/javascript">
var gaJsHost = (("https:" == document.location.protocol) ? "https://ssl." : "http://www.");
document.write(unescape("%3Cscript src='" + gaJsHost + "google-analytics.com/ga.js' type='text/javascript'%3E%3C/script%3E"));
</script>
<script type="text/javascript">
var pageTracker = _gat._getTracker("UA-12988133-1");
pageTracker._trackPageview();
</script>
<script type="text/javascript">
  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-12988133-2']);
  _gaq.push(['_setDomainName', 'none']);
  _gaq.push(['_setAllowLinker', true]);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();
</script>

</body>
</html>
